Revit 2026 API

# CurveIsClosed Property

---

Describes whether the curve is closed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsClosed { get; }
```
```vb
Public ReadOnly Property IsClosed As Boolean
	Get
```
```cpp
public:
property bool IsClosed {
	bool get ();
}
```
```fsharp
member IsClosed : bool with get
```

#### Property Value

Boolean

A curve is "closed" if it is bounded and its start and end points coincide (to within Revit's 3D tolerance), or if it is unbounded and periodic.

#### Reference

Curve Class

Autodesk.Revit.DB Namespace